i = -1
while i < 16:
      i = i+2 
      print(i)
      if i == 13:
        break

i = 0
while i < 20:
    print(i)
    i += 2
    if i == 16:
        break

Создайте цикл, который печатает четные числа до тех пор, пока не выведет ваш возраст. Если ваш возраст — нечетное число, создайте цикл, который печатает нечетные числа до совпадения с возрастом. Программа 
должна выводить на экран нечто подобное:
2
4
6
8
10
12
14

      




